[
  {
    "title": "As Manitoba wildfires rage, premier asks more people to evacuate",
    "headline": "As Manitoba wildfires rage, premier asks more people to evacuate",
    "summary": "The roughly 600 residents of Cranberry Portage in northwestern Manitoba were placed under a mandatory evacuation order because fire had knocked out power to the community.",
    "link": "https://globalnews.ca/news/11207516/manitoba-wildfires-premier-evacuations/"
  },
  {
    "title": "Hudson’s Bay stores across Canada close for good Sunday",
    "headline": "Hudson’s Bay stores across Canada close for good Sunday",
    "summary": "After 355 years in business, Hudson's Bay Company, better known as The Bay, officially closes June 1, and must vacate all of its properties by the end of the month.",
    "link": "https://globalnews.ca/news/11207566/hudsons-bay-stores-canada-close-for-good-sunday/"
  },
  {
    "title": "Canola prices hit tug of war in last week of May",
    "headline": "Canola prices hit tug of war in last week of May",
    "summary": "Canola demand has softened, but dry fields in western Canada were also pulling the canola futures market the other way during the last week of May 2025. \nThe post Canola prices hit tug of war in last week of May appeared first on Manitoba Co-operator.",
    "link": "https://www.manitobacooperator.ca/markets/canola-prices-hit-tug-of-war-in-last-week-of-may/"
  },
  {
    "title": "Individualized cattle care makes money and animal welfare sense",
    "headline": "Individualized cattle care makes money and animal welfare sense",
    "summary": "Watching beef cattle closely for health problems helps the producer chose the best route forward for both the animal and the farm. \nThe post Individualized cattle care makes money and animal welfare sense appeared first on Manitoba Co-operator.",
    "link": "https://www.manitobacooperator.ca/livestock/individualized-cattle-care-makes-money-and-animal-welfare-sense/"
  },
  {
    "title": "Conditions right for pea leaf weevils to thrive",
    "headline": "Conditions right for pea leaf weevils to thrive",
    "summary": "Pea leaf weevils were a challenging pest for pea growers near the Manitoba-Saskatchewan border in 2024. Conditions are right for a repeat performance.",
    "link": "https://www.producer.com/news/conditions-right-for-pea-leaf-weevils-to-thrive/"
  },
  {
    "title": "Free spuds recognize international potato day",
    "headline": "Free spuds recognize international potato day",
    "summary": "The lower-cost potato vegetable compared to other produce items is a key to global food security and overall nutrition",
    "link": "https://www.producer.com/news/free-spuds-recognize-international-potato-day/"
  }
]